//Задание 1
// В переменную password запишите строку с любым произвольным паролем. Проверьте надёжность пароля. Пароль является надёжным, когда в нём есть хотя бы четыре символа, а также есть хотя бы один из символов '-', '_'. Выведите в консоль сообщения «Пароль надёжный» или «Пароль недостаточно надёжный».
// let password = '1-0_1'// Пароль надёжный
let password = '1_1'// Пароль недостаточно надёжный

if (password.length >= 4 && (password.includes('-') || password.includes('_'))) {
    console.log('Пароль надёжный');
} else {
    console.log('Пароль недостаточно надёжный');
}

// Задание 2
// В переменных name, surname написаны имя и фамилия человека. При этом в строках беспорядок с большими и маленькими буквами, и нужно привести строки в порядок. Для этого первые буквы имени и фамилии приведите к верхнему регистру, а оставшиеся буквы — к нижнему. Запишите результат в новые переменные и выведите их значения с помощью console.log. С помощью тернарных операторов и console.log выведите сообщение «Имя было преобразовано» или «Имя осталось без изменений» для имени и фамилии в зависимости от того, были ли исходные строки равны преобразованным.
let name = 'brEndAn';
let surname = 'Eich';

let userName = name[0].toUpperCase() + name.substr(1).toLowerCase();
let userSurname = surname[0].toUpperCase() + surname.substr(1).toLowerCase();

console.log(userName); // Brendan
console.log(userSurname); // Eich

name === userName ? console.log('Имя осталось без изменений') : console.log('Имя было преобразовано');
surname === userSurname ? console.log('Имя осталось без изменений') : console.log('Имя было преобразовано');
